nxp-mcuxpresso/mcux-devices-mcx/MCXW/MCXW236B/drivers/fsl_clock.h
#define CLK_GATE_ABSTRACT_REG_OFFSET(x) (((uint32_t)(x)&CLK_GATE_REG_OFFSET_MASK) >> CLK_GATE_REG_OFFSET_SHIFT)
#define CLK_GATE_ABSTRACT_BITS_SHIFT(x) (((uint32_t)(x)&CLK_GATE_BIT_SHIFT_MASK) >> CLK_GATE_BIT_SHIFT_SHIFT)

#define AHB_CLK_CTRL0 0
#define AHB_CLK_CTRL1 1
#define AHB_CLK_CTRL2 2

/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */
typedef enum _clock_ip_name
{
    kCLOCK_IpInvalid    = 0U,
    kCLOCK_Rom          = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_ROM_SHIFT),
    kCLOCK_Sram1        = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_SRAM_CTRL1_SHIFT),
    kCLOCK_Sram2        = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_SRAM_CTRL2_SHIFT),
    kCLOCK_Flash        = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_FLASH_SHIFT),
    kCLOCK_Fmc          = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_FMC_SHIFT),
    kCLOCK_InputMux     = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_MUX_SHIFT),
    kCLOCK_Iocon        = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_IOCON_SHIFT),
    kCLOCK_Gpio0        = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_GPIO0_SHIFT),
    kCLOCK_Pint         = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_PINT_SHIFT),
    kCLOCK_Gint         = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_GINT_SHIFT),
    kCLOCK_Dma0         = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_DMA0_SHIFT),
    kCLOCK_Crc          = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_CRCGEN_SHIFT),
    kCLOCK_Wwdt         = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_WWDT_SHIFT),
    kCLOCK_Rtc          = CLK_GATE_DEFINE(AHB_CLK_CTRL0, SYSCON_AHBCLKCTRL0_RTC_SHIFT),
    kCLOCK_Mrt          = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_MRT_SHIFT),
    kCLOCK_OsTimer0     = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_OSTIMER_SHIFT),
    kCLOCK_Sct0         = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_SCT_SHIFT),
    kCLOCK_Utick0       = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_UTICK_SHIFT),
    kCLOCK_FlexComm0    = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_FC0_SHIFT),
    kCLOCK_FlexComm1    = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_FC1_SHIFT),
    kCLOCK_FlexComm2    = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_FC2_SHIFT),
    kCLOCK_MinUart0     = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_FC0_SHIFT),
    kCLOCK_MinUart1     = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_FC1_SHIFT),
    kCLOCK_MinUart2     = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_FC2_SHIFT),
    kCLOCK_LSpi0        = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_FC0_SHIFT),
    kCLOCK_LSpi1        = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_FC1_SHIFT),
    kCLOCK_LSpi2        = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_FC2_SHIFT),
    kCLOCK_BI2c0        = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_FC0_SHIFT),
    kCLOCK_BI2c1        = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_FC1_SHIFT),
    kCLOCK_BI2c2        = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_FC2_SHIFT),
    kCLOCK_Timer2       = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_TIMER2_SHIFT),
    kCLOCK_Timer0       = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_TIMER0_SHIFT),
    kCLOCK_Timer1       = CLK_GATE_DEFINE(AHB_CLK_CTRL1, SYSCON_AHBCLKCTRL1_TIMER1_SHIFT),
    kCLOCK_Dma1         = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_DMA1_SHIFT),
    kCLOCK_BleRam       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_BLE_RAM_SHIFT),
    kCLOCK_BleRadio     = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_BLE_RADIO_SHIFT),
    kCLOCK_Freqme       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_FREQME_SHIFT),
    kCLOCK_Rng          = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_RNG_SHIFT),
    kCLOCK_Sysctl       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_SYSCTL_SHIFT),
    kCLOCK_HashCrypt    = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_HASH_AES_SHIFT),
    kCLOCK_PluLut       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_PLULUT_SHIFT),
    kCLOCK_Timer3       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_TIMER3_SHIFT),
    kCLOCK_Timer4       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_TIMER4_SHIFT),
    kCLOCK_Puf          = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_PUF_SHIFT),
    kCLOCK_Casper       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_CASPER_SHIFT),
    kCLOCK_AnalogCtrl   = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_ANALOG_CTRL_SHIFT),
    kCLOCK_Spifi        = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_SPIFI_SHIFT),
    kCLOCK_Gpio_Sec     = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_GPIO_SEC_SHIFT),
    kCLOCK_Gpio_Sec_Int = CLK_GATE_DEFINE(AHB_CLK_CTRL2, SYSCON_AHBCLKCTRL2_GPIO_SEC_INT_SHIFT)
} clock_ip_name_t;

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{
    kCLOCK_CoreSysClk, /*!< Core/system clock  (aka MAIN_CLK)                       */
    kCLOCK_BusClk,     /*!< Bus clock (AHB clock)                                   */
    kCLOCK_ClockOut,   /*!< CLOCKOUT                                                */
    kCLOCK_FroHf,      /*!< FRO32M                                                  */
    kCLOCK_Sct,        /*!< SCT                                                     */
    kCLOCK_Fro12M,     /*!< FRO12M                                                  */
    kCLOCK_Fro24M,     /*!< FRO24M                                                  */
    kCLOCK_ExtClk,     /*!< External Clock                                          */
    kCLOCK_WdtClk,     /*!< Watchdog clock                                          */
    kCLOCK_Flexcomm0,  /*!< Flexcomm0Clock                                          */
    kCLOCK_Flexcomm1,  /*!< Flexcomm1Clock                                          */
    kCLOCK_Flexcomm2,  /*!< Flexcomm2Clock                                          */
    kCLOCK_CTimer0,    /*!< CTimer0Clock                                            */
    kCLOCK_CTimer1,    /*!< CTimer1Clock                                            */
    kCLOCK_CTimer2,    /*!< CTimer2Clock                                            */
    kCLOCK_CTimer3,    /*!< CTimer3Clock                                            */
    kCLOCK_CTimer4,    /*!< CTimer4Clock                                            */
    kCLOCK_Systick,    /*!< System Tick Clock                                       */
    kCLOCK_SpifiClk,   /*!< Spifi Clock                                             */
} clock_name_t;

/*! @brief Clock Mux Switches
 *  The encoding is as follows each connection identified is 32bits wide while 24bits are valuable
 *  starting from LSB upwards
 *
 *  [4 bits for choice, 0 means invalid choice] [8 bits mux ID]*
 *
 */

#define CLK_ATTACH_ID(mux, sel, pos) (((mux << 0U) | ((sel + 1) & 0xFU) << 8U) << (pos * 12U))
#define MUX_A(mux, sel)              CLK_ATTACH_ID(mux, sel, 0U)
#define MUX_B(mux, sel, selector)    (CLK_ATTACH_ID(mux, sel, 1U) | (selector << 24U))

#define GET_ID_ITEM(connection)      ((connection)&0xFFFU)
#define GET_ID_NEXT_ITEM(connection) ((connection) >> 12U)
#define GET_ID_ITEM_MUX(connection)  ((connection)&0xFFU)
#define GET_ID_ITEM_SEL(connection)  ((((connection)&0xF00U) >> 8U) - 1U)
#define GET_ID_SELECTOR(connection)  ((connection)&0xF000000U)

