nxp-mcuxpresso/mcux-devices-mcx/MCXW/MCXW236B/drivers/fsl_clock.h
/*
 * These values are used as an index to find the various CLKSEL registers in SYSCON.
 * Basically, it is the number of registers between the wanted register and SYSTICKCLKSEL0.
 * Gaps in the list indicate reserved registers.
 */
#define CM_SYSTICKCLKSEL (0u)
#define CM_TRACECLKSEL   (2u)
#define CM_CTIMERCLKSEL0 (3u)
#define CM_CTIMERCLKSEL1 (4u)
#define CM_CTIMERCLKSEL2 (5u)
#define CM_CTIMERCLKSEL3 (6u)
#define CM_CTIMERCLKSEL4 (7u)
#define CM_MAINCLKSELA   (8u)
#define CM_MAINCLKSELB   (9u)
#define CM_CLKOUTCLKSEL  (10u)
#define CM_FXCOMCLKSEL0  (20u)
#define CM_FXCOMCLKSEL1  (21u)
#define CM_FXCOMCLKSEL2  (22u)
#define CM_SPIFICLKSEL   (28u)
#define CM_SCTCLKSEL     (36u)

/* RTC is a special case as it is in the PMC. This is treated as a special value in the functions. */
#define CM_RTCOSC32KCLKSEL (63u)

/*
 * These values are the possible selections for each individual CLKSEL register.
 */
/* SEL - System Tick Timer for CPU0 source select. */
#define SYSTICKCLKSEL_SYSTICK_DIV               (0u)
#define SYSTICKCLKSEL_FRO_1MHz                  (1u)
#define SYSTICKCLKSEL_32K_OSC                   (2u)
#define SYSTICKCLKSEL_NO_CLOCK                  (3u)
#define SYSTICKCLKSEL_NO_CLOCK_ALTERNATE_VALUE1 (4u)
#define SYSTICKCLKSEL_NO_CLOCK_ALTERNATE_VALUE2 (5u)
#define SYSTICKCLKSEL_NO_CLOCK_ALTERNATE_VALUE3 (6u)
#define SYSTICKCLKSEL_NO_CLOCK_ALTERNATE_VALUE4 (7u)
/* SEL - Trace clock source select. */
#define TRACECLKSEL_TRACE_DIV                 (0u)
#define TRACECLKSEL_FRO_1MHz                  (1u)
#define TRACECLKSEL_32K_OSC                   (2u)
#define TRACECLKSEL_NO_CLOCK                  (3u)
#define TRACECLKSEL_NO_CLOCK_ALTERNATE_VALUE1 (4u)
#define TRACECLKSEL_NO_CLOCK_ALTERNATE_VALUE2 (5u)
#define TRACECLKSEL_NO_CLOCK_ALTERNATE_VALUE3 (6u)
#define TRACECLKSEL_NO_CLOCK_ALTERNATE_VALUE4 (7u)
/* SEL - CTimer clock source select. */
#define CTIMERCLKSEL_MAINCLK                   (0u)
#define CTIMERCLKSEL_NO_CLOCK                  (1u)
#define CTIMERCLKSEL_NO_CLOCK_ALTERNATE_VALUE1 (2u)
#define CTIMERCLKSEL_FRO_32MHz                 (3u)
#define CTIMERCLKSEL_FRO_1MHz                  (4u)
#define CTIMERCLKSEL_FRO_24MHz                 (5u)
#define CTIMERCLKSEL_32K_OSC                   (6u)
#define CTIMERCLKSEL_NO_CLOCK_ALTERNATE_VALUE2 (7u)
/* SEL - Main clock A source select. */
#define MAINCLKSELA_FRO_12MHz                  (0u)
#define MAINCLKSELA_CLKIN                      (1u)
#define MAINCLKSELA_FRO_1MHz                   (2u)
#define MAINCLKSELA_FRO_32MHz                  (3u)
#define MAINCLKSELA_FRO_12MHz_ALTERNATE_VALUE1 (4u)
#define MAINCLKSELA_CLKIN_ALTERNATE_VALUE1     (5u)
#define MAINCLKSELA_FRO_1MHz_ALTERNATE_VALUE1  (6u)
#define MAINCLKSELA_FRO_32MHz_ALTERNATE_VALUE1 (7u)
/* SEL - Main clock B source select. */
#define MAINCLKSELB_MAINCLKAOUT              (0u)
#define MAINCLKSELB_FRO_24MHz                (1u)
#define MAINCLKSELB_32K_OSC                  (2u)
#define MAINCLKSELB_32K_OSC_ALTERNATE_VALUE1 (3u)
/* SEL - CLKOUT clock source select. */
#define CLKOUTSEL_MAINCLK                   (0u)
#define CLKOUTSEL_NO_CLOCK                  (1u)
#define CLKOUTSEL_CLKIN                     (2u)
#define CLKOUTSEL_FRO_32MHz                 (3u)
#define CLKOUTSEL_FRO_1MHz                  (4u)
#define CLKOUTSEL_FRO_24MHz                 (5u)
#define CLKOUTSEL_32K_OSC                   (6u)
#define CLKOUTSEL_NO_CLOCK_ALTERNATE_VALUE1 (7u)
#define CLKOUTSEL_NO_CLOCK_ALTERNATE_VALUE2 (8u)
#define CLKOUTSEL_NO_CLOCK_ALTERNATE_VALUE3 (9u)
#define CLKOUTSEL_NO_CLOCK_ALTERNATE_VALUE4 (10u)
#define CLKOUTSEL_NO_CLOCK_ALTERNATE_VALUE5 (11u)
#define CLKOUTSEL_NO_CLOCK_ALTERNATE_VALUE6 (12u)
#define CLKOUTSEL_NO_CLOCK_ALTERNATE_VALUE7 (13u)
#define CLKOUTSEL_NO_CLOCK_ALTERNATE_VALUE8 (14u)
#define CLKOUTSEL_NO_CLOCK_ALTERNATE_VALUE9 (15u)
/* SEL - Flexcomm Interface clock source select for Fractional Rate Divider. */
#define FCCLKSEL_MAINCLK                   (0u)
#define FCCLKSEL_NO_CLOCK                  (1u)
#define FCCLKSEL_FRO_12MHz                 (2u)
#define FCCLKSEL_FRO_32MHz_DIV             (3u)
#define FCCLKSEL_FRO_1MHz                  (4u)
#define FCCLKSEL_FRO_24MHz                 (5u)
#define FCCLKSEL_32K_OSC                   (6u)
#define FCCLKSEL_NO_CLOCK_ALTERNATE_VALUE1 (7u)
/* SEL - QuadSPI Flash Interface clock source select. */
#define SPIFICLKSEL_MAINCLK                    (0u)
#define SPIFICLKSEL_FRO_64MHz                  (1u)
#define SPIFICLKSEL_FRO_32MHz                  (2u)
#define SPIFICLKSEL_FRO_32MHz_DIV              (3u)
#define SPIFICLKSEL_FRO_48MHz                  (4u)
#define SPIFICLKSEL_FRO_48MHz_ALTERNATE_VALUE1 (5u)
#define SPIFICLKSEL_FRO_48MHz_ALTERNATE_VALUE2 (6u)
#define SPIFICLKSEL_FRO_48MHz_ALTERNATE_VALUE3 (7u)
/* SEL - SCTimer/PWM clock source select. */
#define SCTCLKSEL_MAINCLK                    (0u)
#define SCTCLKSEL_NO_CLOCK                   (1u)
#define SCTCLKSEL_CLKIN                      (2u)
#define SCTCLKSEL_FRO_32MHz                  (3u)
#define SCTCLKSEL_FRO_24MHz                  (4u)
#define SCTCLKSEL_FRO_24MHz_ALTERNATE_VALUE1 (5u)
#define SCTCLKSEL_FRO_24MHz_ALTERNATE_VALUE2 (6u)
#define SCTCLKSEL_FRO_24MHz_ALTERNATE_VALUE3 (7u)

/* SEL - 0: FRO 32 KHz 1: XTAL 32KHz */
#define RTCOSC32K_SEL_FRO  (0u)
#define RTCOSC32K_SEL_XTAL (1u)

/* SEL - OSTimer clock source select. */
#define OSTIMERCLKSEL_32768                    (0u)
#define OSTIMERCLKSEL_FRO_1MHz                 (1u)
#define OSIMERCLKSEL_NO_CLOCK_ALTERNATE_VALUE1 (2u)
#define OSTIMERCLKSEL_NO_CLOCK                 (3u)

typedef enum _clock_attach_id
{

    kFRO12M_to_MAIN_CLK =
        MUX_A(CM_MAINCLKSELA, MAINCLKSELA_FRO_12MHz) | MUX_B(CM_MAINCLKSELB, MAINCLKSELB_MAINCLKAOUT, 0),
    kEXT_CLK_to_MAIN_CLK = MUX_A(CM_MAINCLKSELA, MAINCLKSELA_CLKIN) | MUX_B(CM_MAINCLKSELB, MAINCLKSELB_MAINCLKAOUT, 0),
    kFRO1M_to_MAIN_CLK =
        MUX_A(CM_MAINCLKSELA, MAINCLKSELA_FRO_1MHz) | MUX_B(CM_MAINCLKSELB, MAINCLKSELB_MAINCLKAOUT, 0),
    kFRO_HF_to_MAIN_CLK =
        MUX_A(CM_MAINCLKSELA, MAINCLKSELA_FRO_32MHz) | MUX_B(CM_MAINCLKSELB, MAINCLKSELB_MAINCLKAOUT, 0),
    kFRO24M_to_MAIN_CLK =
        MUX_A(CM_MAINCLKSELA, MAINCLKSELA_FRO_12MHz) | MUX_B(CM_MAINCLKSELB, MAINCLKSELB_FRO_24MHz, 0),
    kOSC32K_to_MAIN_CLK = MUX_A(CM_MAINCLKSELA, MAINCLKSELA_FRO_12MHz) | MUX_B(CM_MAINCLKSELB, MAINCLKSELB_32K_OSC, 0),

    kMAIN_CLK_to_CLKOUT = MUX_A(CM_CLKOUTCLKSEL, CLKOUTSEL_MAINCLK),
    kEXT_CLK_to_CLKOUT  = MUX_A(CM_CLKOUTCLKSEL, CLKOUTSEL_CLKIN),
    kFRO_HF_to_CLKOUT   = MUX_A(CM_CLKOUTCLKSEL, CLKOUTSEL_FRO_32MHz),
    kFRO1M_to_CLKOUT    = MUX_A(CM_CLKOUTCLKSEL, CLKOUTSEL_FRO_1MHz),
    kFRO24M_to_CLKOUT   = MUX_A(CM_CLKOUTCLKSEL, CLKOUTSEL_FRO_24MHz),
    kOSC32K_to_CLKOUT   = MUX_A(CM_CLKOUTCLKSEL, CLKOUTSEL_32K_OSC),
    kNONE_to_SYS_CLKOUT = MUX_A(CM_CLKOUTCLKSEL, CLKOUTSEL_NO_CLOCK_ALTERNATE_VALUE1),

    kMAIN_CLK_to_FLEXCOMM0   = MUX_A(CM_FXCOMCLKSEL0, FCCLKSEL_MAINCLK),
    kFRO12M_to_FLEXCOMM0     = MUX_A(CM_FXCOMCLKSEL0, FCCLKSEL_FRO_12MHz),
    kFRO_HF_DIV_to_FLEXCOMM0 = MUX_A(CM_FXCOMCLKSEL0, FCCLKSEL_FRO_32MHz_DIV),
    kFRO1M_to_FLEXCOMM0      = MUX_A(CM_FXCOMCLKSEL0, FCCLKSEL_FRO_1MHz),
    kFRO24M_to_FLEXCOMM0     = MUX_A(CM_FXCOMCLKSEL0, FCCLKSEL_FRO_24MHz),
    kOSC32K_to_FLEXCOMM0     = MUX_A(CM_FXCOMCLKSEL0, FCCLKSEL_32K_OSC),
    kNONE_to_FLEXCOMM0       = MUX_A(CM_FXCOMCLKSEL0, FCCLKSEL_NO_CLOCK_ALTERNATE_VALUE1),

    kMAIN_CLK_to_FLEXCOMM1   = MUX_A(CM_FXCOMCLKSEL1, FCCLKSEL_MAINCLK),
    kFRO12M_to_FLEXCOMM1     = MUX_A(CM_FXCOMCLKSEL1, FCCLKSEL_FRO_12MHz),
    kFRO_HF_DIV_to_FLEXCOMM1 = MUX_A(CM_FXCOMCLKSEL1, FCCLKSEL_FRO_32MHz_DIV),
    kFRO1M_to_FLEXCOMM1      = MUX_A(CM_FXCOMCLKSEL1, FCCLKSEL_FRO_1MHz),
    kFRO24M_to_FLEXCOMM1     = MUX_A(CM_FXCOMCLKSEL1, FCCLKSEL_FRO_24MHz),
    kOSC32K_to_FLEXCOMM1     = MUX_A(CM_FXCOMCLKSEL1, FCCLKSEL_32K_OSC),
    kNONE_to_FLEXCOMM1       = MUX_A(CM_FXCOMCLKSEL1, FCCLKSEL_NO_CLOCK_ALTERNATE_VALUE1),

    kMAIN_CLK_to_FLEXCOMM2   = MUX_A(CM_FXCOMCLKSEL2, FCCLKSEL_MAINCLK),
    kFRO12M_to_FLEXCOMM2     = MUX_A(CM_FXCOMCLKSEL2, FCCLKSEL_FRO_12MHz),
    kFRO_HF_DIV_to_FLEXCOMM2 = MUX_A(CM_FXCOMCLKSEL2, FCCLKSEL_FRO_32MHz_DIV),
    kFRO1M_to_FLEXCOMM2      = MUX_A(CM_FXCOMCLKSEL2, FCCLKSEL_FRO_1MHz),
    kFRO24M_to_FLEXCOMM2     = MUX_A(CM_FXCOMCLKSEL2, FCCLKSEL_FRO_24MHz),
    kOSC32K_to_FLEXCOMM2     = MUX_A(CM_FXCOMCLKSEL2, FCCLKSEL_32K_OSC),
    kNONE_to_FLEXCOMM2       = MUX_A(CM_FXCOMCLKSEL2, FCCLKSEL_NO_CLOCK_ALTERNATE_VALUE1),

