nxp-mcuxpresso/mcux-devices-mcx/MCXW/MCXW236B/drivers/fsl_clock.h
    kMAIN_CLK_to_SCT_CLK = MUX_A(CM_SCTCLKSEL, SCTCLKSEL_MAINCLK),
    kEXT_CLK_to_SCT_CLK  = MUX_A(CM_SCTCLKSEL, SCTCLKSEL_CLKIN),
    kFRO_HF_to_SCT_CLK   = MUX_A(CM_SCTCLKSEL, SCTCLKSEL_FRO_32MHz),
    kFRO24M_to_SCT_CLK   = MUX_A(CM_SCTCLKSEL, SCTCLKSEL_FRO_24MHz),

    kFRO32K_to_OSC32K  = MUX_A(CM_RTCOSC32KCLKSEL, RTCOSC32K_SEL_FRO),
    kXTAL32K_to_OSC32K = MUX_A(CM_RTCOSC32KCLKSEL, RTCOSC32K_SEL_XTAL),

    kTRACE_DIV_to_TRACE = MUX_A(CM_TRACECLKSEL, TRACECLKSEL_TRACE_DIV),
    kFRO1M_to_TRACE     = MUX_A(CM_TRACECLKSEL, TRACECLKSEL_FRO_1MHz),
    kOSC32K_to_TRACE    = MUX_A(CM_TRACECLKSEL, TRACECLKSEL_32K_OSC),
    kNONE_to_TRACE      = MUX_A(CM_TRACECLKSEL, TRACECLKSEL_NO_CLOCK_ALTERNATE_VALUE4),

    kSYSTICK_DIV_to_SYSTICK = MUX_A(CM_SYSTICKCLKSEL, SYSTICKCLKSEL_SYSTICK_DIV),
    kFRO1M_to_SYSTICK       = MUX_A(CM_SYSTICKCLKSEL, SYSTICKCLKSEL_FRO_1MHz),
    kOSC32K_to_SYSTICK      = MUX_A(CM_SYSTICKCLKSEL, SYSTICKCLKSEL_32K_OSC),
    kNONE_to_SYSTICK        = MUX_A(CM_SYSTICKCLKSEL, SYSTICKCLKSEL_NO_CLOCK_ALTERNATE_VALUE4),

    kMAIN_CLK_to_CTIMER0 = MUX_A(CM_CTIMERCLKSEL0, CTIMERCLKSEL_MAINCLK),
    kFRO_HF_to_CTIMER0   = MUX_A(CM_CTIMERCLKSEL0, CTIMERCLKSEL_FRO_32MHz),
    kFRO1M_to_CTIMER0    = MUX_A(CM_CTIMERCLKSEL0, CTIMERCLKSEL_FRO_1MHz),
    kFRO24M_to_CTIMER0   = MUX_A(CM_CTIMERCLKSEL0, CTIMERCLKSEL_FRO_24MHz),
    kOSC32K_to_CTIMER0   = MUX_A(CM_CTIMERCLKSEL0, CTIMERCLKSEL_32K_OSC),
    kNONE_to_CTIMER0     = MUX_A(CM_CTIMERCLKSEL0, CTIMERCLKSEL_NO_CLOCK_ALTERNATE_VALUE2),

    kMAIN_CLK_to_CTIMER1 = MUX_A(CM_CTIMERCLKSEL1, CTIMERCLKSEL_MAINCLK),
    kFRO_HF_to_CTIMER1   = MUX_A(CM_CTIMERCLKSEL1, CTIMERCLKSEL_FRO_32MHz),
    kFRO1M_to_CTIMER1    = MUX_A(CM_CTIMERCLKSEL1, CTIMERCLKSEL_FRO_1MHz),
    kFRO24M_to_CTIMER1   = MUX_A(CM_CTIMERCLKSEL1, CTIMERCLKSEL_FRO_24MHz),
    kOSC32K_to_CTIMER1   = MUX_A(CM_CTIMERCLKSEL1, CTIMERCLKSEL_32K_OSC),
    kNONE_to_CTIMER1     = MUX_A(CM_CTIMERCLKSEL1, CTIMERCLKSEL_NO_CLOCK_ALTERNATE_VALUE2),

    kMAIN_CLK_to_CTIMER2 = MUX_A(CM_CTIMERCLKSEL2, CTIMERCLKSEL_MAINCLK),
    kFRO_HF_to_CTIMER2   = MUX_A(CM_CTIMERCLKSEL2, CTIMERCLKSEL_FRO_32MHz),
    kFRO1M_to_CTIMER2    = MUX_A(CM_CTIMERCLKSEL2, CTIMERCLKSEL_FRO_1MHz),
    kFRO24M_to_CTIMER2   = MUX_A(CM_CTIMERCLKSEL2, CTIMERCLKSEL_FRO_24MHz),
    kOSC32K_to_CTIMER2   = MUX_A(CM_CTIMERCLKSEL2, CTIMERCLKSEL_32K_OSC),
    kNONE_to_CTIMER2     = MUX_A(CM_CTIMERCLKSEL2, CTIMERCLKSEL_NO_CLOCK_ALTERNATE_VALUE2),

    kMAIN_CLK_to_CTIMER3 = MUX_A(CM_CTIMERCLKSEL3, CTIMERCLKSEL_MAINCLK),
    kFRO_HF_to_CTIMER3   = MUX_A(CM_CTIMERCLKSEL3, CTIMERCLKSEL_FRO_32MHz),
    kFRO1M_to_CTIMER3    = MUX_A(CM_CTIMERCLKSEL3, CTIMERCLKSEL_FRO_1MHz),
    kFRO24M_to_CTIMER3   = MUX_A(CM_CTIMERCLKSEL3, CTIMERCLKSEL_FRO_24MHz),
    kOSC32K_to_CTIMER3   = MUX_A(CM_CTIMERCLKSEL3, CTIMERCLKSEL_32K_OSC),
    kNONE_to_CTIMER3     = MUX_A(CM_CTIMERCLKSEL3, CTIMERCLKSEL_NO_CLOCK_ALTERNATE_VALUE2),

    kMAIN_CLK_to_CTIMER4 = MUX_A(CM_CTIMERCLKSEL4, CTIMERCLKSEL_MAINCLK),
    kFRO_HF_to_CTIMER4   = MUX_A(CM_CTIMERCLKSEL4, CTIMERCLKSEL_FRO_32MHz),
    kFRO1M_to_CTIMER4    = MUX_A(CM_CTIMERCLKSEL4, CTIMERCLKSEL_FRO_1MHz),
    kFRO24M_to_CTIMER4   = MUX_A(CM_CTIMERCLKSEL4, CTIMERCLKSEL_FRO_24MHz),
    kOSC32K_to_CTIMER4   = MUX_A(CM_CTIMERCLKSEL4, CTIMERCLKSEL_32K_OSC),
    kNONE_to_CTIMER4     = MUX_A(CM_CTIMERCLKSEL4, CTIMERCLKSEL_NO_CLOCK_ALTERNATE_VALUE2),

    kMAIN_CLK_to_SPIFI   = MUX_A(CM_SPIFICLKSEL, SPIFICLKSEL_MAINCLK),
    kFRO64M_to_SPIFI     = MUX_A(CM_SPIFICLKSEL, SPIFICLKSEL_FRO_64MHz),
    kFRO_HF_to_SPIFI     = MUX_A(CM_SPIFICLKSEL, SPIFICLKSEL_FRO_32MHz),
    kFRO_HF_DIV_to_SPIFI = MUX_A(CM_SPIFICLKSEL, SPIFICLKSEL_FRO_32MHz_DIV),
    kFRO48M_to_SPIFI     = MUX_A(CM_SPIFICLKSEL, SPIFICLKSEL_FRO_48MHz),

    kNONE_to_NONE = (int)0x80000000U,
} clock_attach_id_t;

/*
 * These values are used as an index to find the various CLKDIV registers in SYSCON.
 * Basically, it is the number of registers between the wanted register and SYSTICKCLKDIV0.
 * Gaps in the list indicate reserved registers.
 */
typedef enum _clock_div_name
{
    kCLOCK_DivSystickClk  = 0,
    kCLOCK_DivArmTrClkDiv = 2,
    kCLOCK_DivFlexFrg0    = 8,
    kCLOCK_DivFlexFrg1    = 9,
    kCLOCK_DivFlexFrg2    = 10,
    kCLOCK_DivAhbClk      = 32,
    kCLOCK_DivClkOut      = 33,
    kCLOCK_DivFrohfClk    = 34,
    kCLOCK_DivWdtClk      = 35,
    kCLOCK_DivSctClk      = 45,
    kCLOCK_DivSpifiClk    = 52,
    kCLOCK_DivMax         = 52,
} clock_div_name_t;

/*
 * These values are used to select the clock source of the 32kHz OSC in @ref CLOCK_Select32kOscClkSrc.
 */
typedef enum _osc_32k_clock_source
{
    kCLOCK_Osc32kClockSrc_FRO  = 0,
    kCLOCK_Osc32kClockSrc_XTAL = 1
} osc_32k_clock_source_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/**
 * @brief Enable the clock for specific IP.
 * @param name : Clock to be enabled.
 * @return  Nothing
 */
static inline void CLOCK_EnableClock(clock_ip_name_t clk)
{
    uint32_t index               = CLK_GATE_ABSTRACT_REG_OFFSET(clk);
    SYSCON->AHBCLKCTRLSET[index] = (1U << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
}
/**
 * @brief Disable the clock for specific IP.
 * @param name : Clock to be Disabled.
 * @return  Nothing
 */
static inline void CLOCK_DisableClock(clock_ip_name_t clk)
{
    uint32_t index               = CLK_GATE_ABSTRACT_REG_OFFSET(clk);
    SYSCON->AHBCLKCTRLCLR[index] = (1U << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
}

/**
 * @brief Enable/disable 1MHz FRO.
 * @param enable true to enable the 1MHz FRO, false to disable the 1MHz FRO.
 * @return  Nothing
 */
void CLOCK_Enable1MFRO(bool enable);
/**
 * @brief   Initialize the Core clock to given frequency (12, 24 or 32 MHz).
 * Enables the required divided FRO output.
 * Additionally, the 48 or 64 MHz divided FRO output can be enabled. These cannot be used
 * as Core clock.
 * @param   iFreq   : Desired frequency (must be one of #kFreq_12MHz, #kFreq_24MHz, #kFreq_32MHz, #kFreq_48MHz or
 * #kFreq_64MHz)
 * @return  returns success or fail status.
 */
status_t CLOCK_SetupFROClocking(uint32_t iFreq);
/**
 * @brief   Disable generation of the given frequency (12, 24, 32, 48 or 64 MHz) by turning off
 * the required divided FRO output.
 * @param   iFreq   : Desired frequency (must be one of #kFreq_12MHz, #kFreq_24MHz, #kFreq_32MHz, #kFreq_48MHz or
 * #kFreq_64MHz)
 * @return  returns success or fail status.
 */
status_t CLOCK_DisableFROClock(uint32_t iFreq);
/**
 * @brief	Set the flash wait states for the input freuqency.
 * @param	iFreq	: Input frequency in Hz
 * @return	Nothing
 */
void CLOCK_SetFLASHAccessCyclesForFreq(uint32_t iFreq);
/**
 * brief	Get the actual flash wait states.
 * return	ReadWaitStates
 */
uint32_t CLOCK_GetFLASHAccessCycles(void);
/**
 * brief	Set the flash wait states.
 * param	ReadWaitStates
 */
void CLOCK_SetFLASHAccessCycles(uint32_t ReadWaitStates);
/**
 * @brief   Initialize the external osc clock to given frequency.
 * @param   iFreq   : Desired frequency (must be equal to exact rate in Hz)
 * @return  returns success or fail status.
 */
status_t CLOCK_SetupExtClocking(uint32_t iFreq);
/**
 * @brief   Configure the clock selection muxes.
 * @param   connection  : Clock to be configured.
 * @return  Nothing
 */
void CLOCK_AttachClk(clock_attach_id_t connection);
/**
 * @brief   Get the actual clock attach id.
 * This fuction uses the offset in input attach id, then it reads the actual source value in
 * the register and combine the offset to obtain an actual attach id.
 * @param   attachId  : Clock attach id to get.
 * @return  Clock source value.
 */
clock_attach_id_t CLOCK_GetClockAttachId(clock_attach_id_t attachId);
/**
 * @brief   Setup peripheral clock dividers.
 * @param   div_name    : Clock divider name
 * @param divided_by_value: Value to be divided.
 *                          Maximum value is 256.
 *                          Value 0 halts the divider counter.
 * @param reset :  Whether to reset the divider counter.
 * @return  Nothing
 */
void CLOCK_SetClkDiv(clock_div_name_t div_name, uint32_t divided_by_value, bool reset);
/**
 * @brief   Setup rtc 1khz clock divider.
 * @param divided_by_value: Value to be divided
 * @return  Nothing
 */
void CLOCK_SetRtc1khzClkDiv(uint32_t divided_by_value);
/**
 * @brief   Setup rtc 1hz clock divider.
 * @param divided_by_value: Value to be divided
 * @return  Nothing
 */
void CLOCK_SetRtc1hzClkDiv(uint32_t divided_by_value);

/**
 * @brief   Set the flexcomm output frequency.
 * @param   id      : flexcomm instance id
 *          freq    : output frequency
 * @return  0   : the frequency range is out of range.
 *          1   : switch successfully.
 */
uint32_t CLOCK_SetFlexCommClock(uint32_t id, uint32_t freq);

/**
 * @brief   Get the flexcomm output frequency.
 * @param   id      : flexcomm instance id
 *          freq    : output frequency
 * @return  the frequency.
 */
uint32_t CLOCK_GetFlexCommClkFreq(uint32_t id);

/*! @brief  Return Frequency of flexcomm input clock
 *  @param  id     : flexcomm instance id
 *  @return Frequency value
 */
uint32_t CLOCK_GetFlexCommInputClock(uint32_t id);

/*! @brief  Return Frequency of selected clock
 *  @return Frequency of selected clock
 */
uint32_t CLOCK_GetFreq(clock_name_t clockName);
/*! @brief  Return Frequency of FRO 12MHz
 *  @return Frequency of FRO 12MHz
 */
uint32_t CLOCK_GetFro12MFreq(void);
/*! @brief  Return Frequency of FRO 12MHz
 *  @return Frequency of FRO 12MHz
 */
uint32_t CLOCK_GetFro24MFreq(void);
/*! @brief  Return Frequency of FRO 1MHz
 *  @return Frequency of FRO 1MHz
 */
uint32_t CLOCK_GetFro1MFreq(void);
/*! @brief  Return Frequency of ClockOut
 *  @return Frequency of ClockOut
 */
uint32_t CLOCK_GetClockOutClkFreq(void);
/*! @brief  Return Frequency of SCTimer Clock
 *  @return Frequency of SCTimer Clock.
 */
uint32_t CLOCK_GetSctClkFreq(void);
/*! @brief  Return Frequency of SPIFI Clock
 *  @return Frequency of SPIFI Clock.
 */
uint32_t CLOCK_GetSpifiClkFreq(void);
/*! @brief  Return Frequency of External Clock
 *  @return Frequency of External Clock. If no external clock is used returns 0.
 */
uint32_t CLOCK_GetExtClkFreq(void);
/*! @brief  Return Frequency of Watchdog
 *  @return Frequency of Watchdog
 */
uint32_t CLOCK_GetWdtClkFreq(void);
/*! @brief  Return Frequency of High-Freq output of FRO
 *  @return Frequency of High-Freq output of FRO
 */
uint32_t CLOCK_GetFroHfFreq(void);
/*! @brief  Return Frequency of 32kHz osc
 *  @return Frequency of 32kHz osc
 */
uint32_t CLOCK_GetOsc32KFreq(void);
/*! @brief  Return Frequency of Core System
 *  @return Frequency of Core System
 */
uint32_t CLOCK_GetCoreSysClkFreq(void);
/*! @brief  Return Frequency of CTimer functional Clock
 *  @return Frequency of CTimer functional Clock
 */
uint32_t CLOCK_GetCTimerClkFreq(uint32_t id);
/*! @brief  Return Frequency of SystickClock
 *  @return Frequency of Systick Clock
 */
uint32_t CLOCK_GetSystickClkFreq(uint32_t id);
/*! @brief  Return Frequency of OSTimer Clock
 *  @return Frequency of OSTimer Clock.
 */
uint32_t CLOCK_GetOSTimerClkFreq(void);
/*! @brief Enable the OSTIMER 32k clock.
 *  @return  Nothing
 */
void CLOCK_EnableOstimer32kClock(void);

/*! @brief Selects either the XTAL32K or FRO32K as the 32kHz clock source for the system.
 *  @pre   In order to switch from one source to another, both sources have to be enabled.
 *         Note that FRO is always enabled and selected after booting (enabled by bootloader).
 *  @param clockSrc The desired clock source
 *  @return  Nothing
 */
void CLOCK_Select32kOscClkSrc(osc_32k_clock_source_t clockSrc);

/**
 * @brief   Initialize the PLU CLKIN clock to given frequency.
 * @param   iFreq   : Desired frequency (must be equal to exact rate in Hz)
 * @return  returns success or fail status.
 */
status_t CLOCK_SetupPLUClkInClocking(uint32_t iFreq);

/*! @brief  Return Frequency of PLU CLKIN Clock
 *  @return Frequency of PLU CLKIN Clock
 */
uint32_t CLOCK_GetPLUClkInFreq(void);

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @} */

#endif /* _FSL_CLOCK_H_ */
